---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.GenericError
source: html/45428323-0d96-0f96-9d8d-0d57d488d0c0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.GenericError Property

Error.

## Syntax (C#)
```csharp
public static FailureDefinitionId GenericError { get; }
```